{
  "projects": [
    {
      "title": "Portfolio-v2 (AI Part)",
      "description": "This project, which corresponds to this website, integrates a RAG (Retrieval-Augmented Generation) system combined with a Mistral LLM. The data used to power the RAG is based on myself, allowing it to answer any questions you might have about me.",
      "image": "/images/projects/portfolio-ai.png",
      "tags": ["AI"],
      "onlineLink": "https://devj2k.com",
      "githubLink": "https://github.com/DevJ2K/portfolio_v2",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "SnakeAI",
      "description": "This project involves implementing reinforcement learning in a snake game. The snake has very limited vision, and the goal is to achieve the longest possible length through learning.",
      "image": "/images/projects/snake_ai.png",
      "tags": ["AI"],
      "githubLink": "https://github.com/DevJ2K/snakeAI",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "Gomoku",
      "description": "The goal of this project is to develop an AI capable of beating a human player in the game of Gomoku. It uses the Mini-Max Algorithm with Alpha-Beta Pruning, combined with other optimization techniques for better performance.",
      "image": "/images/projects/gomoku.png",
      "tags": ["AI"],
      "githubLink": "https://github.com/DevJ2K/app_gomoku",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "LinearRegression",
      "description": "This project serves as an introduction to a fundamental concept in machine learning: linear regression. The idea is to build a program that predicts the price of a car based on its mileage using a linear regression model trained with a gradient descent algorithm.",
      "image": "/images/projects/ft_linear_regression.png",
      "tags": ["AI"],
      "githubLink": "https://github.com/DevJ2K/ft_linear_regression",
      "isPrivate": false,
      "isSoonOnline": false
    },

    {
      "title": "Portfolio-v2 (Web Part)",
      "description": "This new version of my portfolio is built with Nuxt for the frontend and FastAPI for the backend. It gave me the opportunity to build a complete fullstack application, exploring essential software development concepts, followed by a secure deployment.",
      "image": "/images/projects/portfolio-web.png",
      "tags": ["Web"],
      "onlineLink": "https://devj2k.com",
      "githubLink": "https://github.com/DevJ2K/portfolio_v2",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "???",
      "description": "This still-unreleased project is a full blend of all my knowledge: AI, design, DevOps, user data management, and more. It’s a major milestone in my journey as a developer.",
      "image": "/images/projects/unreleased-2.png",
      "tags": ["Web", "SaaS"],
      "isPrivate": true,
      "isSoonOnline": true
    },
    {
      "title": "Drezly",
      "description": "A SaaS platform designed to empower Vinted resellers with advanced tools to manage and grow their business. Drezly integrates AI-powered features, a Chrome extension, and a comprehensive dashboard.",
      "image": "/images/projects/drezly.png",
      "tags": ["SaaS"],
      "onlineLink": "https://drezly.com",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "Rubik's Cube Solver",
      "description": "The aim of this project was to develop a program capable of solving a Rubik’s Cube using as few moves as possible. Created as a team of two, I mainly worked on the frontend, built with Vue and Three.Js, to produce a nice animated 3D visualization.",
      "image": "/images/projects/app_rubik.png",
      "tags": ["Web"],
      "onlineLink": "https://rubik3d.netlify.app/",
      "githubLink": "https://github.com/DevJ2K/app_rubik",
      "isPrivate": false,
      "isSoonOnline": false
    },

    {
      "title": "Weather3D",
      "description": "A simple weather app built in SwiftUI with a user-friendly interface using the OpenWeather API. It features 3D models rendered with SceneKit that adapt based on the weather and time of day.",
      "image": "/images/projects/weather_app.png",
      "tags": ["Mobile"],
      "githubLink": "https://github.com/DevJ2K/WeatherAppSwiftUI",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "ScreenTimeApp",
      "description": "This project involved developing an app that can lock access to selected apps for a set or indefinite period, using Apple’s ScreenTime API.",
      "image": "/images/projects/screentimeapp.png",
      "tags": ["Mobile"],
      "githubLink": "https://github.com/DevJ2K/ScreenTimeApp",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "SwiftyCompanion",
      "description": "This project is an internal app for my school, using the 42 API to provide various information about students. It’s a great project for learning how to handle APIs efficiently.",
      "image": "/images/projects/swifty_companion.png",
      "tags": ["Mobile"],
      "githubLink": "https://github.com/DevJ2K/42-swifty-companion",
      "isPrivate": false,
      "isSoonOnline": false
    },
    {
      "title": "Tododev",
      "description": "A collaborative to-do list app. The concept is to generate tasks tailored to each user's profile with the help of AI.",
      "image": "/images/projects/tododev.png",
      "tags": ["Mobile"],
      "isPrivate": true,
      "isSoonOnline": false
    }
  ],
  "experiences": [
    {
      "company": "Drezly",
      "duration": "Sep. 2025 - Present",
      "position": "Co-Founder & CTO",
      "logo": "/images/experiences/drezly.png",
      "description": "Built a SaaS platform from the ground up to support Vinted resellers in growing their business. The solution includes integrated AI-powered tools, a Chrome extension, and an advanced analytics dashboard. This project allowed me to apply and expand my expertise across API development, DevOps, full-stack engineering, and AI integration.",
      "connector": "of",
      "clazz": "bg-[#E7D4FF] border-[#BF96FF]"
    },
    {
      "company": "???",
      "duration": "Feb. 2025 - Present",
      "position": "Co-Founder & CTO",
      "logo": "/images/experiences/unknown-project.png",
      "description": "In charge of all aspects of development: architecture, backend, frontend, deployment, and technical strategy.\nThis project is still under wraps...",
      "connector": "of",
      "clazz": "bg-gradient-to-b from-[#E0EFFF] to-[#F5E0FF] border-[#DC8FFF]"
    },
    {
      "company": "Credit Agricole Corporate & Investment Bank",
      "duration": "Jan. 2025 - July 2025",
      "position": "Software Engineer Internship",
      "logo": "/images/experiences/cacib.png",
      "description": "Contributed to the redevelopment of CACIB’s regulatory reporting system, a critical project focused on improving performance, maintainability, and code quality.\n\nDespite having no prior experience with Java, I quickly became operational by working with tools such as Spring Boot, relational databases, and applying the hexagonal architecture pattern. I also learned to apply common design patterns to build scalable and maintainable components. Throughout the project, I adhered to key engineering principles like SOLID and KISS, and used SonarQube to ensure clean and maintainable code.\n\nOne of my main contributions was the development of a key component: a parser that transforms internal banking files (CIBML) into structured Java objects used throughout the processing pipeline.\n\nI also worked on observability, integrating OpenTelemetry, Prometheus, and Grafana to monitor application metrics and detect potential issues early.\n\nThroughout the internship, I actively participated in Agile Scrum workflows alongside Product Owners and developers. The project involved over 200 merge requests, and I became familiar with CI/CD pipelines and collaborative development practices.\n\nThis experience significantly strengthened both my technical and communication skills, especially in explaining complex logic to non-developers in a clear and structured manner.\n\n\n**Feedback from my manager/tutor:**\n*Great integration in the firm. Theo progressed very well on technology on various programimng languages. He will be very welcome again if we wants another experience in CACIB (in France or in other locations).*",
      "connector": "at",
      "clazz": "bg-[#FFFFFF] border-[#DCDCDC]"
    },
    {
      "company": "LudiLab",
      "duration": "Jan. 2025 - Feb. 2025",
      "position": "Fullstack Web3 Developer",
      "logo": "/images/experiences/ludilab.jpeg",
      "description": "During this mission, I designed and developed a fullstack application using Electron, with Vue for the frontend and Python for the backend. The purpose of this application was to integrate a volume bot for the Solana blockchain, with a polished user interface.\n\nThe goal of a volume bot is to simulate buy and sell transactions in order to generate volume on a specific token and create attractiveness around it. These interactions were performed through the Pump.fun platform.\n\n\n**Feedback from the Founder:**\n*Theo went far beyond what we expected, the task was accomplished with great care, requests were quickly understood and perfectly executed. A big bravo to this developer and thank you. I highly recommend this dev.*",
      "connector": "for",
      "clazz": "bg-[#D4D4FF] border-[#A1A0DE]"
    },
    {
      "company": "Belles Des Pins",
      "duration": "Oct. 2024",
      "position": "Mobile Developer",
      "logo": "/images/experiences/bellesdespins.png",
      "description": "During this mission, I was in charge of redesigning the company’s mobile application using SwiftUI. I created the new design in Figma, got it validated, and then implemented it.\n\nImpressed by the quality of my work and how quickly I delivered it, the CEO offered to extend the collaboration by adding new features. These included cart functionality, product filters, and smooth animations to enhance the user experience — which I gladly accepted.\n\n\n**Feedback from the CEO:**\n*I've had the pleasure of working with this freelancer and I'm extremely satisfied with the quality of his work. He demonstrated his professionalism by answering all my questions promptly and always being available to discuss the details of the project.*",
      "connector": "for",
      "clazz": "bg-[#FFE2D4] border-[#DEB4A0]"
    },
    {
      "company": "SamaraCG",
      "duration": "Dec. 2022 - Feb. 2023",
      "position": "Product Designer & Mobile Developer",
      "logo": "/images/experiences/waveinvest.png",
      "description": "As a former sneaker reseller, I identified a clear gap in the market: the absence of a dedicated management tool tailored to reselling needs. I reached out to SamaraCG, a well-known private group specializing in sneaker reselling, to propose building a custom application for their members.\n\nThis led to the creation of WaveSpace, a sneaker management platform designed to help resellers track, organize, and optimize their inventory and operations.\n\n\n**Feedback from the CEO:**\n*To be honest, WaveSpace is one of the best projects I've done with Theo (out of the many we've worked on together). It was an accounting management application specifically designed for trainer retailers, and I have to say I'm absolutely delighted with the result. Théo was very responsive whenever I needed changes or adjustments (with follow-up even after the application was finished). He always listens to my requests and understands my needs perfectly. In terms of value for money, WaveSpace is more than reasonable. Théo offers very competitive rates without ever sacrificing quality of service. He is also very understanding when it comes to budget issues. Overall, I would highly recommend working with Theo as it has been a positive and rewarding experience.*",
      "connector": "for",
      "clazz": "bg-[#FED4FF] border-[#DCA0DE]"
    }
  ],
  "educations": [
    {
      "title": "Self-learning",
      "image": "/images/educations/self_learning.png",
      "borderColor": "border-[#F766FF]",
      "startDate": "Sep. 2020",
      "endDate": "Present",
      "stat": "+140 repositories",
      "description": "Self-driven learning is at the heart of great engineering.",
      "btnIcon": "mingcute:github-line",
      "btnText": "View GitHub",
      "btnActive": true,
      "link": "https://github.com/DevJ2K"
    },
    {
      "title": "42 Paris",
      "image": "/images/educations/42.png",
      "borderColor": "border-[#FFC966]",
      "startDate": "Sep. 2023",
      "endDate": "2026",
      "stat": "+76 solo & team projects",
      "description": "Enroll for a Master's degree in IT Architecture, specialized in AI & Data.",
      "btnIcon": "ic:outline-lock",
      "btnText": "View Master's degree",
      "btnActive": false
    },
    {
      "title": "Harvard University",
      "image": "/images/educations/harvard.png",
      "borderColor": "border-[#FF6666]",
      "startDate": "2025",
      "stat": "-",
      "description": "Online courses about CS and AI.",
      "btnIcon": "ic:outline-lock",
      "btnText": "View Certificate",
      "btnActive": false
    }
  ],
  "skills": [
    {
      "name": "Python",
      "description": "My favorite language — I use it in most of my projects.",
      "achievements": [
        "FastAPI for building modern APIs",
        "Robust unit testing with Pytest and Unittest",
        "Widely used in AI and data-related projects"
      ]
    },
    {
      "name": "Nuxt",
      "description": "My go-to framework for building web apps.",
      "achievements": [
        "Built on Vue with a clear and intuitive syntax",
        "Quick to set up and ideal for dynamic interfaces",
        "Perfect for full-stack web development"
      ]
    },
    {
      "name": "Java",
      "description": "A great language for enterprise-level applications.",
      "achievements": [
        "Built stable backends with Spring Boot",
        "Valuable for scalable architectures",
        "Applied in real-world business environments"
      ]
    },
    {
      "name": "Swift",
      "description": "My favorite language for mobile development.",
      "achievements": [
        "Clean syntax and powerful IDE (Xcode)",
        "Excellent official documentation and community support"
      ]
    },
    {
      "name": "C",
      "description": "The first language I used during the core curriculum at 42.",
      "achievements": [
        "Helped me understand low-level memory management",
        "Gained deep understanding of how computers work",
        "Extremely fast and efficient at runtime"
      ]
    },
    {
      "name": "C++",
      "description": "The second language I used during the core curriculum at 42.",
      "achievements": [
        "Great for mastering object-oriented programming concepts",
        "Used in algorithms and systems logic",
        "Popular and backed by strong documentation"
      ]
    },
    {
      "name": "Firebase",
      "description": "My primary choice for cloud-based databases.",
      "achievements": [
        "Easy to set up and manage",
        "Cost-effective for low-to-medium traffic apps",
        "Strong ecosystem with real-time capabilities"
      ]
    },
    {
      "name": "Docker",
      "description": "Essential for building production-ready apps.",
      "achievements": [
        "Containerization of frontend and backend services",
        "Simplifies deployment and environment consistency",
        "Ideal for multi-machine development setups"
      ]
    },
    {
      "name": "Typescript",
      "description": "I use it in all my web projects.",
      "achievements": [
        "Improves code clarity with type safety",
        "Works seamlessly with ESLint and modern frameworks"
      ]
    }
  ]
}
